retsimx/tlsr8266_mesh/sdk/vendor/light_8266/main_light.c
                light_adjust_RGB(led_val[0], led_val[1], led_val[2], led_lum);
                
                lum_changed_time = clock_time();
            }
        	else if (op == LGT_CMD_SET_RGB_VALUE)
        	{
        	    if(light_off){
        	        return;
        	    }
        		if(params[0] == 1){		        //R
        		    led_val[0] = params[1];
                    light_adjust_R (led_val[0], led_lum);
        		}else if(params[0] == 2){		//G
        		    led_val[1] = params[1];
                    light_adjust_G (led_val[1], led_lum);
        		}else if(params[0] == 3){		//B
        		    led_val[2] = params[1];
                    light_adjust_B (led_val[2], led_lum);
        		}else if(params[0] == 4){		//RGB
        		    led_val[0] = params[1];
        		    led_val[1] = params[2];
        		    led_val[2] = params[3];
        		    light_adjust_RGB(led_val[0], led_val[1], led_val[2], led_lum);
        		}else if(params[0] == 5){		//CT
        		    //temporary processing as brightness
                    if(light_off || params[1] > 100 || led_lum == params[1]){
                        return;
                    }
                    led_lum = params[1];
                    light_adjust_RGB(led_val[0], led_val[1], led_val[2], led_lum);
        		}
        		
                lum_changed_time = clock_time();
        	}
        	else if (op == LGT_CMD_KICK_OUT)
        	{
        		if(is_mesh_cmd_need_delay(p, params, pp->val[op_cmd_len+params_len])){
        			return ;
        		}
        	    irq_disable();
        	    void kick_out(u8 par);
        	    kick_out(params[0]);
        	    light_sw_reboot();
        	}
#if(ALARM_EN)
        	else if (op == LGT_CMD_SET_TIME)
        	{
                rtc_t rtc_old, rtc_new;
                memcpy(&rtc_old, &rtc, sizeof(rtc_t));
        	    memcpy(&rtc_new.year, params, 7);
        	    if(0 == rtc_set_time((rtc_t *)params)){
        	        //ok
        	        check_event_after_set_time(&rtc_new, &rtc_old);
                    cfg_led_event(LED_EVENT_FLASH_1HZ_3T);
        	    }else{
        	        //invalid params
                    cfg_led_event(LED_EVENT_FLASH_4HZ_3T);
        	    }
        	}
        	else if (op == LGT_CMD_ALARM)
        	{
        	    if(0 == alarm_ev_callback((u8*)params)){
                    cfg_led_event(LED_EVENT_FLASH_1HZ_3T);
        	    }else{
                    cfg_led_event(LED_EVENT_FLASH_4HZ_3T);
        	    }
        	}
#endif        	
#if(SCENE_EN)
        	else if (op == LGT_CMD_SET_SCENE)
        	{
        	    if(params[0] == SCENE_ADD){
        	        // add scene: params valid & no repetition
        	        scene_t *pData = (scene_t*)(params+1);
        	        if(pData->id && pData->lum <= 100 
            	            && pData->rgb[0] <= 0xFF
            	            && pData->rgb[1] <= 0xFF
            	            && pData->rgb[2] <= 0xFF){
                        if(scene_add(pData)){
                            cfg_led_event(LED_EVENT_FLASH_1HZ_3T);
                        }
        	        }
        	            
        	    }else if(params[0] == SCENE_DEL){
        	        // del scene
        	        if(scene_del(params[1])){
                        cfg_led_event(LED_EVENT_FLASH_1HZ_3T);
        	        }
        	    }
        	}
        	else if (op == LGT_CMD_LOAD_SCENE)
        	{
        	    scene_load(params[0]);
        	}
#endif
#if 1 // (LIGHT_NOTIFY_MESH_EN)
            else if (op == LGT_CMD_NOTIFY_MESH)
            {
                light_notify(pp->val+3, 10, pp->src);
            }
#endif        	
            else if (op == LGT_CMD_MESH_OTA_DATA)
            {
                u16 idx = params[0] + (params[1] << 8);
                if(!is_master_ota_st()){  // no update firmware for itself
                    if(CMD_START_MESH_OTA == idx){
                        mesh_ota_master_start_firmware_from_own();
                        //cfg_led_event(LED_EVENT_FLASH_1HZ_4S);
                    }else if(CMD_STOP_MESH_OTA == idx){
                        if(is_mesh_ota_slave_running()){
                            // reboot to initial flash: should be delay to relay command.
                            mesh_ota_slave_reboot_delay();  // reboot after 320ms
                        }
                    }else{
                        if(mesh_ota_slave_save_data(params)){
                            static u16 mesh_ota_error_cnt;
                            mesh_ota_error_cnt++;
                        }
                    }
                }else{
                    if(CMD_STOP_MESH_OTA == idx){
                        mesh_ota_master_cancle(OTA_STATE_MASTER_OTA_REBOOT_ONLY, 0);
                        //cfg_led_event(LED_EVENT_FLASH_4HZ_3T);
                    }
                }
            }
#if(MESH_PAIR_ENABLE)
            else if (op == LGT_CMD_MESH_PAIR)
            {
                mesh_pair_cb(params);
            }
#endif
#if SW_GET_MESH_DATA
		else if(op == LGT_CMD_SW_DATA)
		{
			static u8 cnt;
			if((++cnt)%2)
				light_onoff(0);
			else
				light_onoff(1);
			SWClock = clock_time();
			SWTxCnt = 0;
		}
#endif
        }
    }
}

/*@brief: This function is called in IRQ state, use IRQ stack.
**@param: p: p is pointer to response
**@param: p_cmd_rx: is pointer to request command*/
int rf_link_response_callback (u8 *p, u8 *p_cmd_rx)
{
    // mac-app[5] low 2 bytes used as ttc && hop-count 
    rf_packet_att_value_t *ppp = (rf_packet_att_value_t*)(p);
    rf_packet_att_value_t *p_req = (rf_packet_att_value_t*)(p_cmd_rx);
    bool dst_unicast = is_unicast_addr(p_req->dst);
	memcpy(ppp->dst, p_req->src, 2);
	memcpy(ppp->src, &device_address, 2);
	set_sub_addr2rsp((device_addr_sub_t *)ppp->src, p_req->dst, dst_unicast);
	//memcpy(ppp->dst, (u8*)&slave_group, 2);
	
#if(ALARM_EN || SCENE_EN)
	#if SUB_ADDR_EN
	device_addr_sub_t *p_adr_sub = (device_addr_sub_t *)ppp->src;
	u8 need_bridge = p_adr_sub->dev_id != get_addr_by_pointer(ppp->dst);
	#else
	u8 need_bridge = (0 != memcmp(ppp->src, ppp->dst, 2));
	#endif
#endif

