retsimx/tlsr8266_mesh/sdk/vendor/light_8266/main_light.c
	rf_link_slave_set_buffer (buff_response[0], 48);

	//rf_link_set_debug_adv_channel (38);

	rf_link_set_max_bridge (BRIDGE_MAX_CNT);
	vendor_id_init(VENDOR_ID);
	
	usb_dp_pullup_en (1);

	//extern void	rf_link_set_max_relay (u8 num);
	//rf_link_set_max_relay (3);
	
	light_hw_timer0_config();
	light_hw_timer1_config();

	extern u32 online_status_timeout;
    online_status_timeout = ONLINE_STATUS_TIMEOUT;
    
#if(PA_ENABLE)
    pa_init(0, 0);
#endif

#if(SCENE_EN)
    scene_init();
#endif

#if(MESH_PAIR_ENABLE)
	mesh_pair_init();
#endif
}

void light_set_master_data(void){
	// write_master_data means need to send some data to master,just padding data into send_to_master[]
	if(write_master_data){
		write_master_data = 0;
		memcpy(send_to_master, (u8*)&slave_send_data, 4);
	}
}

void light_auth_check(void){
	if(security_enable && !pair_login_ok && slave_first_connected_tick && clock_time_exceed(slave_first_connected_tick, AUTH_TIME*1000*1000)){
		//rf_link_slave_disconnect(); // must login in 60s after connected, if need
		slave_first_connected_tick = 0;
	}
}

void light_user_func(void){
	light_set_master_data();
	
	light_auth_check();

    extern int factory_reset_cnt_check ();
	factory_reset_cnt_check();
	
	// save current lum-val
	if(lum_changed_time && clock_time_exceed(lum_changed_time, 5000*1000)){
		lum_changed_time = 0;
		light_lum_store();
	}

	// music function timeout
	if(last_music_tick && clock_time_exceed(last_music_tick, 3000*1000)){
	    music_time = last_music_tick = 0;
        led_lum = led_lum_tmp;
        light_adjust_RGB(led_val[0], led_val[1], led_val[2], led_lum);
	}

#if(MESH_PAIR_ENABLE)
	mesh_pair_proc_effect();
#endif
}

////////////////////////////////////////////////////////////////////////////
void main_loop(void)
{
	static u32  dbg_m_loop;
	dbg_m_loop++;
	
	if(is_receive_ota_window()){
		return ;
	}

	//flash_protect_debug();
#if SW_GET_MESH_DATA
	static u32 ClockCont = 0;
	if(SWClock && clock_time_exceed(SWClock, 1000*1000)){
		if(SWTxCnt && (!clock_time_exceed(ClockCont, 100*1000)))
			;
		else{
			light_respond_to_sw();
			ClockCont = clock_time();
			if(++SWTxCnt == 5){
				SWClock = 0;
				SWTxCnt = 0;
			}
		}
	}
#endif
	
#if(ALARM_EN)
	alarm_handle();
#endif

#if(SCENE_EN)
	scene_handle();
#endif	
    
	//light_sim_light2light();
	//light_sim_notify();
#if(LIGHT_NOTIFY_MESH_EN)
	light_sim_notify_mesh();
#endif	

	light_user_func ();
	
	rf_link_slave_proc ();

	proc_led ();
#if (BATT_CHECK_ENABLE)
    app_battery_power_check_and_sleep_handle(1);
#endif
#if GATEWAY_EN
    proc_ui_gateway ();
#endif    

#if(STACK_CHECK_ENABLE)
    stack_check();
#endif

	//proc_debug ();

#if DEUBG_UART_TEXT_EN
	printf ("main loop: %d\r\n", dbg_m_loop);
	sleep_us (100000);
#endif

#if DEUBG_UART_HEX_EN
	USBUART (dbg_m_loop>>24);
	USBUART (dbg_m_loop>>16);
	USBUART (dbg_m_loop>>8);
	USBUART (dbg_m_loop);
#endif

#if UART_ENABLE 
    if(uart_rx_true){
        uart_rx_true = 0;
        u32 rx_len = T_rxdata_buf.len + 4 > sizeof(T_rxdata_user) ? sizeof(T_rxdata_user) : T_rxdata_buf.len + 4;
        memcpy(&T_rxdata_user, &T_rxdata_buf, rx_len);
        uart_Send((u8 *)(&T_rxdata_user));
    }
#endif

#if ADC_SET_CHN_ENABLE
	static u32 adc_tmp_check_time;
	if(clock_time_exceed(adc_tmp_check_time, 40*1000)){
        adc_tmp_check_time = clock_time();
        #if (ADC_CHNM_REF_SRC == ADC_REF_AVDD)
        u32 v_ref = 3300;
        #elif(ADC_CHNM_REF_SRC == ADC_REF_1_3V)
        u32 v_ref = 1260;
        #endif
        static u32 T_adc_val_tmp;
		static u32 T_adc_mv;
        T_adc_val_tmp = adc_get();
		T_adc_mv = (T_adc_val_tmp * v_ref) >> 14 ;
    }
#endif
}

////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////

void  user_init(void)
{
    #if (BATT_CHECK_ENABLE)
    app_battery_power_check_and_sleep_handle(0); //battery check must do before OTA relative operation
    #endif
	blc_readFlashSize_autoConfigCustomFlashSector();
    flash_get_id();
    
#if 1	
	// for app ota   
	if(0 == is_ota_area_valid(flash_adr_light_new_fw)){
		erase_ota_data(flash_adr_light_new_fw);
	}
#endif
	
    flash_protect_8266_normal();
#if ADC_SET_CHN_ENABLE
	adc_Init(ADC_CHNM_ANA_INPUT, ADC_CHNM_REF_SRC);
#endif

	extern void set_vendor_function(void);
	set_vendor_function();

	light_init_default();

	if(p_vendor_user_init){
		p_vendor_user_init();
	}else{
		pwm_set (PWMID_R, PMW_MAX_TICK, PMW_MAX_TICK);
		pwm_set (PWMID_G, PMW_MAX_TICK, PMW_MAX_TICK);
		pwm_set (PWMID_B, PMW_MAX_TICK, 0);
		
		//retrieve lumen value
		light_lum_retrieve();

		pwm_start (PWMID_R);
		pwm_start (PWMID_G);
		pwm_start (PWMID_B);
		
		gpio_set_func (PWM_R, !AS_GPIO);
		gpio_set_func (PWM_G, !AS_GPIO);
		gpio_set_func (PWM_B, !AS_GPIO);
	}
	
#if (SW_NO_PAIR_ENABLE)
	extern u8 sw_no_pair;
	sw_no_pair = 1;
#endif
	rf_link_slave_init (40000);

    extern int factory_reset_handle ();
    factory_reset_handle();

	extern void vendor_set_adv_data(void);
	vendor_set_adv_data();

#if UART_ENABLE
    //Initial IO
    gpio_set_func(GPIO_UTX, AS_UART); 
    gpio_set_func(GPIO_URX, AS_UART); 
    
    CLK32M_UART115200;
    uart_BuffInit((u8 *)(&T_rxdata_buf), sizeof(T_rxdata_buf), (u8 *)(&T_txdata_buf));
#endif	
	
#if(IBEACON_ENABLE)
	#if 0 // apple ibeacon
    if (*(u16 *) FLASH_ADR_BEACON_MAJOR != 0xFFFF){
    	u16 major_data = *(u16 *) FLASH_ADR_BEACON_MAJOR;
    	major_data = (major_data << 8) | ((major_data >> 8) & 0x00FF);
        ibeacon_customer_data.major = major_data;
    }
    if (*(u16 *) FLASH_ADR_BEACON_MINOR != 0xFFFF){
    	u16 minor_data = *(u16 *) FLASH_ADR_BEACON_MINOR;
    	minor_data = (minor_data << 8) | ((minor_data >> 8) & 0x00FF);
        ibeacon_customer_data.minor = minor_data;
    }
    if (*(u32 *) FLASH_ADR_BEACON_UUID != 0xFFFFFFFF){
		u8 customer_UUID[16] = {0};
    	flash_read_page(FLASH_ADR_BEACON_UUID, 16, customer_UUID);
		memcpy(ibeacon_customer_data.proximity_UUID, customer_UUID, 16);
    }
    if (*(u16 *) FLASH_ADR_BEACON_COMPANYID != 0xFFFF){
		ibeacon_customer_data.company_ID = *(u16 *) FLASH_ADR_BEACON_COMPANYID;
    }
    
    beacon_len = sizeof(ibeacon_adv_t);
    memcpy(iBeaconData, &ibeacon_customer_data, beacon_len);
    set_ibeacon_data(iBeaconData, beacon_len);
	#endif
    #if 0 // eddystone UID
    extern u8 mac_id[];
    memcpy(eddystone_uid + 23, mac_id, 6);
    beacon_len = 31;
    memcpy(iBeaconData, eddystone_uid, beacon_len);
    set_ibeacon_data(iBeaconData, beacon_len);
    #endif
    #if 0 // eddystone URL
    beacon_len = eddystone_url[0]+eddystone_url[3]+eddystone_url[7]+3;
    memcpy(iBeaconData, eddystone_url, beacon_len);
    set_ibeacon_data(iBeaconData, beacon_len);
    #endif
    #if 0 // eddystone TLM
    beacon_len = 25;
    memcpy(iBeaconData, eddystone_tlm, beacon_len);
    set_ibeacon_data(iBeaconData, beacon_len);
    #endif
    iBeaconInterval = IBEACON_INTERVAL;
	beacon_with_mesh_adv = 1;
#endif

#if(STACK_CHECK_ENABLE)
    stack_check_init();
#endif

#if (SYNC_TIME_EN)
    sync_time_en(1);
#endif    
	device_status_update();
    mesh_security_enable (1);
	
	if(!security_enable){
	    //not_need_login = pair_login_ok = 1;// 1 means not need login when no-security mode.
	}else{
	    //extern u8 rands_fix_flag;
        //rands_fix_flag = 1;       // 1 means rands[8] = {0xb0, 0xb1, 0xb2, 0xb3, 0xb4, 0xb5, 0xb6, 0xb7};
	}

#if GATEWAY_EN
    gateway_init();
    gateway_mode_onoff(1);
    gateway_security = 0;
    gateway_set_login_flag();
#endif

    #if 0// callback for node status changed
    extern void light_node_status_change_cb(u8 *p, u8 new_node);
    extern void	register_mesh_node_status_callback (void *p);
    register_mesh_node_status_callback(&light_node_status_change_cb);
    #endif

    #if 0// 'set_mesh_info_time' means after this time from power-on,set mesh info will be refused.
    extern u32 set_mesh_info_time;// unit: s
    set_mesh_info_time = 30;
    #endif
    
    #if 0
    extern u8 send_adv_flag; // default value is 1, 0 means don't send adv pkt.
    send_adv_flag = 0;
    #endif
    
#if I2C_HW_MODOULE_EN   // I2C init
    i2c_pin_initial(PIN_I2C_SDA, PIN_I2C_SCL);
    #if I2C_MASTER_MODE
    i2c_init(); // master mode
    #else
    i2c_slave_init(I2C_IRQ_EN); // slave mode
    #endif
#endif

    register_mesh_ota_master_ui(mesh_ota_master_led);   //  mesh_ota_master_led() will be called when sending mesh ota data.
}
#endif

